// SDEF Output From L:\RTKERNEL\LSL_OS\RTOS_C.H, line 1
//$$!SDEF ON
//
//	Lasal Application C Header File
//
//	Rev 1.0, 01/30/01
//
//	This file contains various definitions and includes for use by
//	Lasal C applications.
//
//

#pragma once

// ###%%%### THR 2/26/02: Required for VDDC Projects
//
//	Windows/MSVC Include Files
//
#define WIN32_LEAN_AND_MEAN
#include <windows.h>
#include <stdio.h>



//
//	Define Various Types
//
#define LSL_APPLICATION

//	Define misc. types for LSL_APPLICATION
#define RTKMailbox void*
#define RTKAPI
#define RTKSemaphore void
#define RTKTaskHandle long

typedef unsigned short	WORD;
typedef unsigned char	BYTE;
typedef unsigned long	DWORD;
typedef long 			LONG;
typedef int				BOOL;


typedef struct {
   unsigned long TimeLow;
   unsigned long TimeHigh;
} RTKFineTime;

typedef struct {                     // interrupt gate descriptor
   WORD  Offset_Lower;
   WORD  CodeSelector;
   unsigned int Id:13;
   unsigned int DPL:2;
   unsigned int P:1;
   unsigned int Offset_Upper:16;
} RTInterruptGate;



//
//	RTOS / LASAL Include Files
//
#include <RTOS_CGlobals.h>		// RTOS Global Def's for C
#include <RTOS_CMacros.h>

#include <LSL_C_IFSSR.h>	// THR LSE V1.40: Switched Order!
#include <LSL_CITask.h>

#include <LSL_C_IFLINKER.h>


// SDEF Output From L:\RTKERNEL\LSL_OS\LslDefs.h, line 30
//	$$!SDEF ON
//

//
//	Define some type definitions common to IEC-1131
//
typedef char           CHAR;
typedef unsigned char  USINT;
//typedef short          INT;
typedef unsigned short _UINT;
typedef long           DINT;
typedef unsigned long  UDINT;


//
//	Define Std. LASAL OS Calling Parameters
//
//		LSLREG: LASAL Register Parameter Calling Function - uses C fast call
//		LSLAPI: LASAL Task API - Uses RTTarget calling API
//
#define LSLREG _fastcall
#define LSLAPI RTTAPI


//
//	Define "freindly" names for some common RT Kernel functions
//
#define lslOutByte			RTOut
#define lslInByte			RTIn
#define lslSTI				RTEnableInterrupts();
#define lslCLI				RTDisableInterrupts();
#define lslIRQEnd			RTIRQEnd
#define lslEnableIRQ		RTEnableIRQ


//
//	Define Generic CPU LED Codes
//
#define LED_RAM     0   //  Run RAM (gelb)
#define LED_RAM_OFF 1
#define LED_ROM     2   //  Run ROM (gelb)
#define LED_ROM_OFF 3
#define LED_ERR     4   //  Error IRQ (rot)
#define LED_ERR_OFF 5

//
//	Define Generic CPU States
//

//     _1
//    ===
//   |   |
//  2| 4 |_2
//    ===
//  1|   |_4
//   |   |
//    ===  *8
//     _8
//
// Figures with "_" => lower nibble
//

#define LSL_DISP_ERROR_TXT       0x7950 // 0111 1001   0101 0000  "Er"
#define LSL_DISP_LINKER_TXT      0x3854 // 0011 1000   0011 0000  "Ln"
#define LSL_DISP_LINKRUN_TXT     0x7350 // 0111 1000   0011 0000  "Pr"
#define LSL_DISP_OPBURN_TXT      0x3F73 // 0111 1111   0011 0000  "OP"
#define ST_DEBUG    2
#define ST_ERROR    1
#define ST_RUN      0


//
//	Define CPU Status Codes
//
typedef enum
{
  CS_RUN_RAM = 0,
  CS_RUN_ROM,
  CS_RUNTIME,
  CS_POINTER,
  CS_CHKSUM,
  CS_WATCHDOG,
  CS_ERROR,
  CS_PROM_DEFECT,
  CS_RESET,
  CS_WD_DEFECT,
  CS_STOP,         //10
  CS_BUSY_PROG,
  CS_PGM_TOO_LONG,
  CS_PROG_END,
  CS_PROG_MEMO,
  CS_STOP_BRKPT,
  CS_CPU_STOP,
  CS_INTERROR,
  CS_SINGLESTEP,
  CS_READY,
  CS_LOAD,         //20
  CS_WRONG_MODULE,
  CS_MEMORY_FULL,
  CS_NOT_LINKED,
  CS_DIV_BY,
  CS_DIAS_ERROR,
  CS_WAIT,
  CS_OP_PROG,
  CS_OP_INSTALLED,
  CS_OP_TOO_LONG,
  CS_NO_OPSYS,     //30
  CS_SEARCH_OPSYS,
  CS_NO_DEVICE,
  CS_UNUSED_CODE,
  CS_MEMORY_ERROR,
  CS_MAX_IO,

  // Ab hier die LASAL-RTOS Meldungen
  CS_ACCESS = 50,
  CS_BND_EXCEED,
  CS_PRIV_INSTR,


  //Reserved for ScreenSaver:
  //scr_active   0x60
  //scr_         0x61
  //scr_         0x62

  CS_PRE_RUN   = 0xFD,
  CS_PRE_RESET,

  CS_LINKING   = 0xE0,
  CS_LINKERROR = 0xE1, 
  CS_LINKDONE  = 0xE2,

  CS_OP_BURN   = 230,

  CS_USVWAIT   = 0xF0,
  CS_REBOOT    = 0xF1,
  CS_RAMSAVE   = 0xF2,
  CS_RAMLOAD   = 0xF3,

  CS_NONE      = 0xFF,
}CP_STAT;


//
//	Define Command Status Codes
////////////////////////////////////
#define  COM_RUN_RAM		0
#define  COM_RUN_ROM		1
#define  COM_RUNTIME		2
#define  COM_POINTER		3
#define  COM_CHKSUM			4
#define  COM_WATCHDOG		5
#define  COM_ERROR			6		
#define  COM_PROM_DEFECT	7
#define  COM_RESET			8
#define  COM_WD_DEFECT		9
#define  COM_STOP			10
#define  COM_BUSY_PROG		11
#define  COM_PGM_TOO_LONG	12
#define  COM_PROG_END		13
#define  COM_PROG_MEMO		14
#define  COM_STOP_BRKPT		15
#define  COM_CPU_STOP		16
#define  COM_INTERROR		17
#define  COM_SINGLESTEP		18
#define  COM_READY			19
#define  COM_LOAD			20
#define  COM_WRONG_MODULE	21
#define  COM_MEMORY_FULL	22
#define  COM_NOT_LINKED		23
#define  COM_DIV_BY			24
#define  COM_DIAS_ERROR		25
#define  COM_WAIT			26
#define  COM_OP_PROG		27
#define  COM_OP_INSTALLED	28
#define  COM_OP_TOO_LONG	29
#define  COM_NO_OPSYS		30
#define  COM_SEARCH_OPSYS	31
#define  COM_NO_DEVICE		32
#define  COM_UNUSED_CODE	33
#define  COM_MEMORY_ERROR	34
#define  COM_MAX_IO			35

  // Ab hier die LASAL-RTOS Meldungen
#define  COM_ACCESS			50
#define  COM_BND_EXCEED		51
#define  COM_PRIV_INSTR		52

  //Reserved for ScreenSaver:
  //scr_active             0x60
  //scr_                   0x61
  //scr_                   0x62

#define  COM_PRE_RUN		253
#define  COM_PRE_RESET	    254
#define  COM_LINKING		224
#define  COM_LINKERROR	225
#define  COM_LINKDONE		226

#define  COM_OP_BURN		230

#define  COM_USVWAIT		240
#define  COM_REBOOT			241
#define  COM_RAMSAVE		242
#define  COM_RAMLOAD		243

#define  COM_NONE			255

  // can the next command be executed?
#define  COM_BUSY_FLAG		512
//////////////////////////////////////

typedef struct CMD_BUF_STRUCT
{
	unsigned long cmd;
	struct CMD_BUF_STRUCT* next;
} CMD_BUF;

//
//	The following structure is used to store the CPU registers.
//
typedef struct
{
   UDINT rGS;
   UDINT rFS;
   UDINT rES;
   UDINT rDS;
   UDINT rEDI;
   UDINT rESI;
   UDINT rEBP;
   UDINT rESP;
   UDINT rEBX;
   UDINT rEDX;
   UDINT rECX;
   UDINT rEAX;
// eip nur res (nicht am stack)
   UDINT rEIP;
   UDINT rCS;
// efl nur res (nicht am stack)
   UDINT rEFL;
   UDINT rSS;
   UDINT res0;
   UDINT res1;
   UDINT res2;
}LSL_REG;


// Structure of the registers in the Debugger routine:
// Never change this structure!!!
typedef struct
{
   UDINT rEDI;  // 04
   UDINT rESI;  // 08
   UDINT rEBP;  // 12
   UDINT rESP;  // 16
   UDINT rEBX;  // 20
   UDINT rEDX;  // 24
   UDINT rECX;  // 28
   UDINT rEAX;  // 32
   UDINT rEIP;  // 36
   UDINT  rCS;  // 40
   UDINT rEFL;  // 44
   UDINT  rSS;  // 48
   UDINT  rGS;  // 52
   UDINT  rFS;  // 56
   UDINT  rES;  // 60
   UDINT  rDS;  // 64
   UDINT rEIPrelativ; // 66
   UDINT ModulID;  // 68
}CP_REG;

//
//	Define Various Common Vectors
//	(common to ALL platforms)
//
// SW-INT Vectoren
#define DIV_VECTOR 0
#define TRP_VECTOR 1
#define NMI_VECTOR 2
#define BRK_VECTOR 3
#define BND_VECTOR 5
#define OPC_VECTOR 6
#define STK_VECTOR 12
#define GPE_VECTOR 13
#define PGF_VECTOR 14

// HW - Vectoren
#define HW_DEB_VECTOR 	1
#define HW_BRK_VECTOR   3
#define HW_BND_VECTOR   5


//
//	Define the LASAL Exception Structure
//
typedef struct
{
  USINT  type;
  #define LSL_EXC_HW         0x80
  #define LSL_EXC_SW         0x40
  #define LSL_EXC_ERROR      0x20
  #define LSL_EXC_WARNING    0x10

  USINT  source;
  #define LSL_EXC_DIAS       25
  #define LSL_EXC_CAN        200

  _UINT  code;
  // LSL_EXC_CAN:
  #define LSL_EXC_CAN_BOFF   1

  // LSL_EXC_DIAS:
//  #define LSL_EXC_DIAS_
}LSL_EXCEPT;


//
//--- Inline ASM Befehle -----------------------------------------------------
//	Define some in-line assmebly code macros
//
#define lslPUSHA    _asm pusha
